tiborsimon/embedded-tdd-headers/pic/8bit/pic18f24k40_tdd.h
#define CWG1LSAC1                     1091
#define LSBD0                         1092
#define CWG1LSBD0                     1093
#define LSBD                          1094
#define CWG1LSBD                      1095
#define LSBD1                         1096
#define CWG1LSBD1                     1097
#define CWG1REN                       1098
#define REN                           1099
#define CWG1SHUTDOWN                  1100
#define SHUTDOWN                      1101
#define CWG1AS1                       1102
#define AS0E                          1103
#define AS1E                          1104
#define AS2E                          1105
#define AS3E                          1106
#define AS4E                          1107
#define AS5E                          1108
#define CWG1STR                       1109
#define CWG1STRA                      1110
#define STRA                          1111
#define STRB                          1112
#define CWG1STRB                      1113
#define CWG1STRC                      1114
#define STRC                          1115
#define CWG1STRD                      1116
#define STRD                          1117
#define OVRA                          1118
#define CWG1OVRA                      1119
#define CWG1OVRB                      1120
#define OVRB                          1121
#define OVRC                          1122
#define CWG1OVRC                      1123
#define OVRD                          1124
#define CWG1OVRD                      1125
#define SCANLADRL                     1126
#define SCANLADRL_LADR                1127
#define SCANLADRL_SCANLADR            1128
#define LADR0                         1129
#define SCANLADR0                     1130
#define SCANLADR1                     1131
#define LADR1                         1132
#define LADR2                         1133
#define SCANLADR2                     1134
#define LADR3                         1135
#define SCANLADR3                     1136
#define LADR4                         1137
#define SCANLADR4                     1138
#define LADR5                         1139
#define SCANLADR5                     1140
#define SCANLADR6                     1141
#define LADR6                         1142
#define LADR7                         1143
#define SCANLADR7                     1144
#define SCANLADRH                     1145
#define LADR8                         1146
#define SCANLADRH_SCANLADR            1147
#define SCANLADR8                     1148
#define SCANLADRH_LADR                1149
#define LADR9                         1150
#define SCANLADR9                     1151
#define LADR10                        1152
#define SCANLADR10                    1153
#define SCANLADR11                    1154
#define LADR11                        1155
#define LADR12                        1156
#define SCANLADR12                    1157
#define LADR13                        1158
#define SCANLADR13                    1159
#define LADR14                        1160
#define SCANLADR14                    1161
#define LADR15                        1162
#define SCANLADR15                    1163
#define SCANLADRU                     1164
#define LADR16                        1165
#define SCANLADR16                    1166
#define SCANLADRU_SCANLADR            1167
#define SCANLADRU_LADR                1168
#define SCANLADR17                    1169
#define LADR17                        1170
#define LADR18                        1171
#define SCANLADR18                    1172
#define LADR19                        1173
#define SCANLADR19                    1174
#define SCANLADR20                    1175
#define LADR20                        1176
#define SCANLADR21                    1177
#define LADR21                        1178
#define SCANHADRL                     1179
#define SCANHADR0                     1180
#define HADR0                         1181
#define SCANHADRL_HADR                1182
#define SCANHADRL_SCANHADR            1183
#define SCANHADR1                     1184
#define HADR1                         1185
#define SCANHADR2                     1186
#define HADR2                         1187
#define SCANHADR3                     1188
#define HADR3                         1189
#define SCANHADR4                     1190
#define HADR4                         1191
#define SCANHADR5                     1192
#define HADR5                         1193
#define SCANHADR6                     1194
#define HADR6                         1195
#define SCANHADR7                     1196
#define HADR7                         1197
#define SCANHADRH                     1198
#define HADR8                         1199
#define SCANHADRH_SCANHADR            1200
#define SCANHADR8                     1201
#define SCANHADRH_HADR                1202
#define HADR9                         1203
#define SCANHADR9                     1204
#define HADR10                        1205
#define SCANHADR10                    1206
#define SCANHADR11                    1207
#define HADR11                        1208
#define HADR12                        1209
#define SCANHADR12                    1210
#define HADR13                        1211
#define SCANHADR13                    1212
#define HADR14                        1213
#define SCANHADR14                    1214
#define HADR15                        1215
#define SCANHADR15                    1216
#define SCANHADRU                     1217
#define SCANHADRU_SCANHADR            1218
#define SCANHADRU_HADR                1219
#define HADR16                        1220
#define SCANHADR16                    1221
#define SCANHADR17                    1222
#define HADR17                        1223
#define HADR18                        1224
#define SCANHADR18                    1225
#define HADR19                        1226
#define SCANHADR19                    1227
#define HADR20                        1228
#define SCANHADR20                    1229
#define SCANHADR21                    1230
#define HADR21                        1231
#define SCANCON0                      1232
#define SCANMODE0                     1233
#define SCANCON0_MODE                 1234
#define SCANCON0_MODE0                1235
#define SCANMODE                      1236
#define SCANMODE1                     1237
#define SCANCON0_MODE1                1238
#define INTM                          1239
#define SCANINTM                      1240
#define DABORT                        1241
#define SCANINVALID                   1242
#define INVALID                       1243
#define SCANCON0_BUSY                 1244
#define SCANBUSY                      1245
#define SCANCON0_GO                   1246
#define SCANGO                        1247
#define SCANCON0_EN                   1248
#define SCANEN                        1249
#define SCANTRIG                      1250
#define TSEL0                         1251
#define TSEL                          1252
#define SCANTSEL0                     1253
#define SCANTSEL                      1254
#define TSEL1                         1255
#define SCANTSEL1                     1256
#define TSEL2                         1257
#define SCANTSEL2                     1258
#define TSEL3                         1259
#define SCANTSEL3                     1260
#define MDCON0                        1261
#define MDBIT                         1262
#define BIT                           1263
#define OPOL                          1264
#define MDOPOL                        1265
#define MDOUT                         1266
#define MDCON0_OUT                    1267
#define MDEN                          1268
#define MDCON0_EN                     1269
#define MDCON1                        1270
#define MDCLSYNC                      1271
#define CLSYNC                        1272
#define MDCLPOL                       1273
#define CLPOL                         1274
#define CHSYNC                        1275
#define MDCHSYNC                      1276
#define MDCHPOL                       1277
#define CHPOL                         1278
#define MDSRC                         1279
#define SRCS0                         1280
#define MDSRCS                        1281
#define SRCS                          1282
#define MDSRCS0                       1283
#define SRCS1                         1284
#define MDSRCS1                       1285
#define SRCS2                         1286
#define MDSRCS2                       1287
#define SRCS3                         1288
#define MDSRCS3                       1289
#define MDCARL                        1290
#define CLS0                          1291
#define MDCLS                         1292
#define MDCLS0                        1293
#define CLS                           1294
#define CLS1                          1295
#define MDCLS1                        1296
#define CLS2                          1297
#define MDCLS2                        1298
#define MDCARH                        1299
#define CHS0                          1300
#define CHS                           1301
#define MDCHS                         1302
#define MDCHS0                        1303
#define CHS1                          1304
#define MDCHS1                        1305
#define CHS2                          1306
#define MDCHS2                        1307
#define ADACT0                        1308
#define ADACT                         1309
#define ADACT1                        1310
#define ADACT2                        1311
#define ADACT3                        1312
#define ADACT4                        1313
#define ADCLK                         1314
#define ADCS0                         1315
#define ADCLK_ADCS                    1316
#define ADCS1                         1317
#define ADCS2                         1318
#define ADCS3                         1319
#define ADCS4                         1320
#define ADCS5                         1321
#define ADREF                         1322
#define ADPREF                        1323
#define ADPREF0                       1324
#define ADPREF1                       1325
#define ADNREF                        1326
#define ADCON1                        1327
#define ADDSEN                        1328
#define NVCFG0                        1329
#define NVCFG1                        1330
#define PVCFG0                        1331
#define CHSN3                         1332
#define PVCFG1                        1333
#define VCFG11                        1334
#define ADGPOL                        1335
#define ADIPEN                        1336
#define ADPPOL                        1337
#define ADCON2                        1338
#define ADMD                          1339
#define ADMD0                         1340
#define ADMD1                         1341
#define ADMD2                         1342
#define ADACLR                        1343
#define ADCRS                         1344
#define ADCRS0                        1345
#define ADCRS1                        1346
#define ADCRS2                        1347
#define ADPSIS                        1348
#define ADCON3                        1349
#define ADTMD                         1350
#define ADTMD0                        1351
#define ADTMD1                        1352
#define ADTMD2                        1353
#define ADSOI                         1354
#define ADCALC                        1355
#define ADCALC0                       1356
#define ADCALC1                       1357
#define ADCALC2                       1358
#define ADACQ                         1359
#define ADACQ0                        1360
#define ADACQ1                        1361
#define ADACQ2                        1362
#define ADACQ3                        1363
#define ADACQ4                        1364
#define ADACQ5                        1365
#define ADACQ6                        1366
#define ADACQ7                        1367
#define ADCAP                         1368
#define ADCAP0                        1369
#define ADCAP1                        1370
#define ADCAP2                        1371
#define ADCAP3                        1372
#define ADCAP4                        1373
#define ADPRE0                        1374
#define ADPRE                         1375
#define ADPRE1                        1376
#define ADPRE2                        1377
#define ADPRE3                        1378
#define ADPRE4                        1379
#define ADPRE5                        1380
#define ADPRE6                        1381
#define ADPRE7                        1382
#define ADPCH                         1383
#define ADPCH0                        1384
#define ADPCH1                        1385
#define ADPCH2                        1386
#define ADPCH3                        1387
#define ADPCH4                        1388
#define ADPCH5                        1389
#define ADCON0                        1390
#define ADCON0_GO                     1391
#define DONE                          1392
#define GO_NOT_DONE                   1393
#define GO_nDONE                      1394
#define ADGO                          1395
#define GODONE                        1396
#define ADFM                          1397
#define ADFM0                         1398
#define ADCON0_ADCS                   1399
#define ADCONT                        1400
#define ADCAL                         1401
#define ADON                          1402
#define ADPREVL                       1403
#define ADPREV0                       1404
#define ADPREV1                       1405
#define ADPREV2                       1406
#define ADPREV3                       1407
#define ADPREV4                       1408
#define ADPREV5                       1409
#define ADPREV6                       1410
#define ADPREV7                       1411
#define ADPREVH                       1412
#define ADPREV8                       1413
#define ADPREV9                       1414
#define ADPREV10                      1415
#define ADPREV11                      1416
#define ADPREV12                      1417
#define ADPREV13                      1418
#define ADPREV14                      1419
#define ADPREV15                      1420
#define ADRESL                        1421
#define ADRES0                        1422
#define ADRES1                        1423
#define ADRES2                        1424
#define ADRES3                        1425
#define ADRES4                        1426
#define ADRES5                        1427
#define ADRES6                        1428
#define ADRES7                        1429
#define ADRESH                        1430
#define ADRES8                        1431
#define ADRES9                        1432
#define ADRES10                       1433
#define ADRES11                       1434
#define ADRES12                       1435
#define ADRES13                       1436
#define ADRES14                       1437
#define ADRES15                       1438
#define ADSTAT                        1439
#define ADSTAT0                       1440
#define ADSTAT1                       1441
#define ADSTAT2                       1442
#define ADMATH                        1443
#define ADLTHR                        1444
#define ADUTHR                        1445
#define ADAOV                         1446
#define ADRPT0                        1447
#define ADRPT                         1448
#define ADRPT1                        1449
#define ADRPT2                        1450
#define ADRPT3                        1451
#define ADRPT4                        1452
#define ADRPT5                        1453
#define ADRPT6                        1454
#define ADRPT7                        1455
#define ADCNT0                        1456
#define ADCNT                         1457
#define ADCNT1                        1458
#define ADCNT2                        1459
#define ADCNT3                        1460
#define ADCNT4                        1461
#define ADCNT5                        1462
#define ADCNT6                        1463
#define ADCNT7                        1464
#define ADSTPT0                       1465
#define ADSTPTL                       1466
#define ADSTPT1                       1467
#define ADSTPT2                       1468
#define ADSTPT3                       1469
#define ADSTPT4                       1470
#define ADSTPT5                       1471
#define ADSTPT6                       1472
#define ADSTPT7                       1473
#define ADSTPT8                       1474
#define ADSTPTH                       1475
#define ADSTPT9                       1476
#define ADSTPT10                      1477
#define ADSTPT11                      1478
#define ADSTPT12                      1479
#define ADSTPT13                      1480
#define ADSTPT14                      1481
#define ADSTPT15                      1482
#define ADLTH0                        1483
#define ADLTHL                        1484
#define ADLTH1                        1485
#define ADLTH2                        1486
#define ADLTH3                        1487
#define ADLTH4                        1488
#define ADLTH5                        1489
#define ADLTH6                        1490
#define ADLTH7                        1491
#define ADLTH8                        1492
#define ADLTHH                        1493
#define ADLTH9                        1494
#define ADLTH10                       1495
#define ADLTH11                       1496
#define ADLTH12                       1497
#define ADLTH13                       1498
#define ADLTH14                       1499
#define ADLTH15                       1500
#define ADUTH0                        1501
#define ADUTHL                        1502
#define ADUTH1                        1503
#define ADUTH2                        1504
#define ADUTH3                        1505
#define ADUTH4                        1506
#define ADUTH5                        1507
#define ADUTH6                        1508
#define ADUTH7                        1509
#define ADUTH8                        1510
#define ADUTHH                        1511
#define ADUTH9                        1512
#define ADUTH10                       1513
#define ADUTH11                       1514
#define ADUTH12                       1515
#define ADUTH13                       1516
#define ADUTH14                       1517
#define ADUTH15                       1518
#define ADERR0                        1519
#define ADERRL                        1520
#define ADERR1                        1521
#define ADERR2                        1522
#define ADERR3                        1523
#define ADERR4                        1524
#define ADERR5                        1525
#define ADERR6                        1526
#define ADERR7                        1527
#define ADERR8                        1528
#define ADERRH                        1529
#define ADERR9                        1530
#define ADERR10                       1531
#define ADERR11                       1532
#define ADERR12                       1533
#define ADERR13                       1534
#define ADERR14                       1535
#define ADERR15                       1536
#define ADACC0                        1537
#define ADACCL                        1538
#define ADACC1                        1539
#define ADACC2                        1540
#define ADACC3                        1541
#define ADACC4                        1542
#define ADACC5                        1543
#define ADACC6                        1544
#define ADACC7                        1545
#define ADACC8                        1546
#define ADACCH                        1547
#define ADACC9                        1548
#define ADACC10                       1549
#define ADACC11                       1550
#define ADACC12                       1551
#define ADACC13                       1552
#define ADACC14                       1553
#define ADACC15                       1554
#define ADFLTR0                       1555
#define ADFLTRL                       1556
#define ADFLTR1                       1557
#define ADFLTR2                       1558
#define ADFLTR3                       1559
#define ADFLTR4                       1560
#define ADFLTR5                       1561
#define ADFLTR6                       1562
#define ADFLTR7                       1563
#define ADFLTR8                       1564
#define ADFLTRH                       1565
#define ADFLTR9                       1566
#define ADFLTR10                      1567
#define ADFLTR11                      1568
#define ADFLTR12                      1569
#define ADFLTR13                      1570
#define ADFLTR14                      1571
#define ADFLTR15                      1572
#define CRCDATL                       1573
#define DATA0                         1574
#define DATA1                         1575
#define DATA2                         1576
#define DATA3                         1577
#define DATA4                         1578
#define DATA5                         1579
#define DATA6                         1580
#define DATA7                         1581
#define CRCDATH                       1582
#define DATA8                         1583
#define DATA9                         1584
#define DATA10                        1585
#define DATA11                        1586
#define DATA12                        1587
#define DATA13                        1588
#define DATA14                        1589
#define DATA15                        1590
#define CRCACCL                       1591
#define ACC0                          1592
#define ACC1                          1593
#define ACC2                          1594
#define ACC3                          1595
#define ACC4                          1596
#define ACC5                          1597
#define ACC6                          1598
#define ACC7                          1599
#define CRCACCH                       1600
#define ACC8                          1601
#define ACC9                          1602
#define ACC10                         1603
#define ACC11                         1604
#define ACC12                         1605
#define ACC13                         1606
#define ACC14                         1607
#define ACC15                         1608
#define CRCSHIFTL                     1609
#define SHFT0                         1610
#define SHFT1                         1611
#define SHFT2                         1612
#define SHFT3                         1613
#define SHFT4                         1614
#define SHFT5                         1615
#define SHFT6                         1616
#define SHFT7                         1617
#define CRCSHIFTH                     1618
#define SHFT8                         1619
#define SHFT9                         1620
#define SHFT10                        1621
#define SHFT11                        1622
#define SHFT12                        1623
#define SHFT13                        1624
#define SHFT14                        1625
#define SHFT15                        1626
#define CRCXORL                       1627
#define X1                            1628
#define X2                            1629
#define X3                            1630
#define X4                            1631
#define X5                            1632
#define X6                            1633
#define X7                            1634
#define CRCXORH                       1635
#define X8                            1636
#define X9                            1637
#define X10                           1638
#define X11                           1639
#define X12                           1640
#define X13                           1641
#define X14                           1642
#define X15                           1643
#define CRCCON0                       1644
#define FULL                          1645
#define SHIFTM                        1646
#define ACCM                          1647
#define CRCCON0_BUSY                  1648
