tiborsimon/embedded-tdd-headers/pic/8bit/pic18f24k40_tdd.h
#define CRCGO                         1649
#define CRCCON0_EN                    1650
#define CRCEN                         1651
#define CRCCON1                       1652
#define PLEN0                         1653
#define PLEN                          1654
#define PLEN1                         1655
#define PLEN2                         1656
#define PLEN3                         1657
#define DLEN                          1658
#define DLEN0                         1659
#define DLEN1                         1660
#define DLEN2                         1661
#define DLEN3                         1662
#define NVMADRL                       1663
#define ADR0                          1664
#define ADR                           1665
#define NVMADR0                       1666
#define ADR1                          1667
#define NVMADR1                       1668
#define ADR2                          1669
#define NVMADR2                       1670
#define ADR3                          1671
#define NVMADR3                       1672
#define ADR4                          1673
#define NVMADR4                       1674
#define NVMADR5                       1675
#define ADR5                          1676
#define ADR6                          1677
#define NVMADR6                       1678
#define ADR7                          1679
#define NVMADR7                       1680
#define NVMDAT0                       1681
#define NVMDAT                        1682
#define NVMDAT1                       1683
#define NVMDAT2                       1684
#define NVMDAT3                       1685
#define NVMDAT4                       1686
#define NVMDAT5                       1687
#define NVMDAT6                       1688
#define NVMDAT7                       1689
#define NVMCON1                       1690
#define RD                            1691
#define WR                            1692
#define WREN                          1693
#define WRERR                         1694
#define FREE                          1695
#define NVMREG                        1696
#define NVMREG0                       1697
#define NVMREG1                       1698
#define NVMCON2                       1699
#define LATA                          1700
#define LATA0                         1701
#define LA0                           1702
#define LATA1                         1703
#define LA1                           1704
#define LATA2                         1705
#define LA2                           1706
#define LATA3                         1707
#define LA3                           1708
#define LATA4                         1709
#define LA4                           1710
#define LATA5                         1711
#define LA5                           1712
#define LATA6                         1713
#define LA6                           1714
#define LATA7                         1715
#define LA7                           1716
#define LATB                          1717
#define LB0                           1718
#define LATB0                         1719
#define LB1                           1720
#define LATB1                         1721
#define LB2                           1722
#define LATB2                         1723
#define LB3                           1724
#define LATB3                         1725
#define LB4                           1726
#define LATB4                         1727
#define LB5                           1728
#define LATB5                         1729
#define LB6                           1730
#define LATB6                         1731
#define LB7                           1732
#define LATB7                         1733
#define LATC                          1734
#define LATC0                         1735
#define LC0                           1736
#define LATC1                         1737
#define LC1                           1738
#define LATC2                         1739
#define LC2                           1740
#define LATC3                         1741
#define LC3                           1742
#define LATC4                         1743
#define LC4                           1744
#define LATC5                         1745
#define LC5                           1746
#define LATC6                         1747
#define LC6                           1748
#define LATC7                         1749
#define LC7                           1750
#define TRISA                         1751
#define TRISA0                        1752
#define TRISA_RA0                     1753
#define TRISA1                        1754
#define TRISA_RA1                     1755
#define TRISA2                        1756
#define TRISA_RA2                     1757
#define TRISA3                        1758
#define TRISA_RA3                     1759
#define TRISA_RA4                     1760
#define TRISA4                        1761
#define TRISA_RA5                     1762
#define TRISA5                        1763
#define TRISA_RA6                     1764
#define TRISA6                        1765
#define TRISA_RA7                     1766
#define TRISA7                        1767
#define TRISB                         1768
#define TRISB_RB0                     1769
#define TRISB0                        1770
#define TRISB_RB1                     1771
#define TRISB1                        1772
#define TRISB_RB2                     1773
#define TRISB2                        1774
#define TRISB_RB3                     1775
#define TRISB3                        1776
#define TRISB_RB4                     1777
#define TRISB4                        1778
#define TRISB_RB5                     1779
#define TRISB5                        1780
#define TRISB_RB6                     1781
#define TRISB6                        1782
#define TRISB_RB7                     1783
#define TRISB7                        1784
#define TRISC                         1785
#define TRISC0                        1786
#define TRISC_RC0                     1787
#define TRISC1                        1788
#define TRISC_RC1                     1789
#define TRISC2                        1790
#define TRISC_RC2                     1791
#define TRISC3                        1792
#define TRISC_RC3                     1793
#define TRISC4                        1794
#define TRISC_RC4                     1795
#define TRISC5                        1796
#define TRISC_RC5                     1797
#define TRISC6                        1798
#define TRISC_RC6                     1799
#define TRISC7                        1800
#define TRISC_RC7                     1801
#define PORTA                         1802
#define ULPWUIN                       1803
#define PORTA_RA0                     1804
#define PORTA_RA1                     1805
#define PORTA_RA2                     1806
#define PORTA_RA3                     1807
#define PORTA_RA4                     1808
#define LVDIN                         1809
#define PORTA_RA5                     1810
#define PORTA_RA6                     1811
#define PORTA_RA7                     1812
#define RJPU                          1813
#define PORTB                         1814
#define PORTB_RB0                     1815
#define PORTB_RB1                     1816
#define PORTB_RB2                     1817
#define CCP2_PA2                      1818
#define PORTB_RB3                     1819
#define PORTB_RB4                     1820
#define PORTB_RB5                     1821
#define PORTB_RB6                     1822
#define PORTB_RB7                     1823
#define PORTC                         1824
#define PORTC_RC0                     1825
#define PA2                           1826
#define PORTC_RC1                     1827
#define CCP2                          1828
#define PA1                           1829
#define PORTC_RC2                     1830
#define PORTC_RC3                     1831
#define PORTC_RC4                     1832
#define PORTC_RC5                     1833
#define PORTC_RC6                     1834
#define PORTC_RC7                     1835
#define PORTE                         1836
#define RE3                           1837
#define PC3E                          1838
#define CCP9E                         1839
#define SSP1BUF                       1840
#define SSPBUF                        1841
#define SSP1ADD                       1842
#define SSP1ADD_MSK0                  1843
#define MSK01                         1844
#define SSPADD                        1845
#define SSP1ADD_MSK1                  1846
#define MSK11                         1847
#define SSP1ADD_MSK2                  1848
#define MSK21                         1849
#define MSK31                         1850
#define SSP1ADD_MSK3                  1851
#define SSP1ADD_MSK4                  1852
#define MSK41                         1853
#define MSK51                         1854
#define SSP1ADD_MSK5                  1855
#define MSK61                         1856
#define SSP1ADD_MSK6                  1857
#define SSP1ADD_MSK7                  1858
#define MSK71                         1859
#define SSP1MSK                       1860
#define SSP1MSK_MSK0                  1861
#define SSPMSK                        1862
#define SSP1MSK_MSK1                  1863
#define SSP1MSK_MSK2                  1864
#define SSP1MSK_MSK3                  1865
#define SSP1MSK_MSK4                  1866
#define SSP1MSK_MSK5                  1867
#define SSP1MSK_MSK6                  1868
#define SSP1MSK_MSK7                  1869
#define SSP1STAT                      1870
#define BF                            1871
#define BF1                           1872
#define UA1                           1873
#define UA                            1874
#define R_NOT_W                       1875
#define READ_WRITE                    1876
#define RW1                           1877
#define R_W                           1878
#define nW                            1879
#define RW                            1880
#define nWRITE                        1881
#define R                             1882
#define NOT_WRITE                     1883
#define R_nW                          1884
#define I2C_READ                      1885
#define START                         1886
#define START1                        1887
#define S                             1888
#define I2C_START                     1889
#define STOP                          1890
#define STOP1                         1891
#define I2C_STOP                      1892
#define P                             1893
#define DATA_ADDRESS                  1894
#define nA                            1895
#define D_A                           1896
#define D_nA                          1897
#define D                             1898
#define DA1                           1899
#define DA                            1900
#define D_NOT_A                       1901
#define NOT_ADDRESS                   1902
#define nADDRESS                      1903
#define I2C_DAT                       1904
#define CKE                           1905
#define CKE1                          1906
#define SMP                           1907
#define SMP1                          1908
#define SSP1CON1                      1909
#define SSPM0                         1910
#define SSPM                          1911
#define SSPM01                        1912
#define SSPM1                         1913
#define SSPM11                        1914
#define SSPM2                         1915
#define SSPM21                        1916
#define SSPM31                        1917
#define SSPM3                         1918
#define CKP                           1919
#define CKP1                          1920
#define SSPEN                         1921
#define SSPEN1                        1922
#define SSPOV1                        1923
#define SSPOV                         1924
#define WCOL1                         1925
#define WCOL                          1926
#define SSP1CON2                      1927
#define SEN1                          1928
#define SSP1CON2_SEN                  1929
#define ADMSK11                       1930
#define ADMSK                         1931
#define RSEN1                         1932
#define RSEN                          1933
#define ADMSK1                        1934
#define PEN                           1935
#define ADMSK21                       1936
#define PEN1                          1937
#define ADMSK2                        1938
#define ADMSK31                       1939
#define RCEN                          1940
#define RCEN1                         1941
#define ADMSK3                        1942
#define ACKEN                         1943
#define ACKEN1                        1944
#define ADMSK41                       1945
#define ADMSK4                        1946
#define ACKDT1                        1947
#define ADMSK51                       1948
#define ADMSK5                        1949
#define ACKDT                         1950
#define ACKSTAT                       1951
#define ACKSTAT1                      1952
#define GCEN                          1953
#define GCEN1                         1954
#define SSP1CON3                      1955
#define DHEN                          1956
#define AHEN                          1957
#define SBCDE                         1958
#define SDAHT                         1959
#define BOEN                          1960
#define SCIE                          1961
#define PCIE                          1962
#define ACKTIM                        1963
#define RC1REG                        1964
#define TX1REG                        1965
#define SP1BRGL                       1966
#define SP1BRGH                       1967
#define RC1STA                        1968
#define RCD8                          1969
#define RX9D                          1970
#define OERR                          1971
#define FERR                          1972
#define ADDEN                         1973
#define CREN                          1974
#define SREN                          1975
#define SRENA                         1976
#define RC8_9                         1977
#define RC9                           1978
#define RX9                           1979
#define SPEN                          1980
#define TX1STA                        1981
#define TXD8                          1982
#define TX9D1                         1983
#define TX9D                          1984
#define TRMT                          1985
#define TRMT1                         1986
#define BRGH1                         1987
#define BRGH                          1988
#define SENDB1                        1989
#define SENDB                         1990
#define TX1STA_SYNC                   1991
#define SYNC1                         1992
#define TXEN1                         1993
#define TXEN                          1994
#define TX91                          1995
#define TX8_9                         1996
#define TX9                           1997
#define CSRC1                         1998
#define CSRC                          1999
#define BAUD1CON                      2000
#define ABDEN1                        2001
#define ABDEN                         2002
#define WUE1                          2003
#define WUE                           2004
#define W4E                           2005
#define BRG16                         2006
#define BRG161                        2007
#define SCKP                          2008
#define TXCKP                         2009
#define SCKP1                         2010
#define TXCKP1                        2011
#define CKTXP                         2012
#define RCMT                          2013
#define RCIDL                         2014
#define RCIDL1                        2015
#define RCMT1                         2016
#define ABDOVF                        2017
#define ABDOVF1                       2018
#define PWM4DCL                       2019
#define PWM4DCL_PWMPW0                2020
#define PWM4DCL_DC                    2021
#define PWM4DC0                       2022
#define PWM4DCL_DC0                   2023
#define PWM4DCL_PWMPW1                2024
#define PWM4DC1                       2025
#define PWM4DCL_DC1                   2026
#define PWM4DCH                       2027
#define PWM4DCH_PWMPW2                2028
#define PWM4DCH_DC                    2029
#define PWM4DC2                       2030
#define PWM4DCH_DC2                   2031
#define PWM4DCH_PWMPW3                2032
#define PWM4DC3                       2033
#define PWM4DCH_DC3                   2034
#define PWM4DCH_PWMPW4                2035
#define PWM4DC4                       2036
#define PWM4DCH_DC4                   2037
#define PWM4DCH_PWMPW5                2038
#define PWM4DC5                       2039
#define PWM4DCH_DC5                   2040
#define PWM4DCH_PWMPW6                2041
#define PWM4DC6                       2042
#define PWM4DCH_DC6                   2043
#define PWM4DCH_PWMPW7                2044
#define PWM4DC7                       2045
#define PWM4DCH_DC7                   2046
#define PWM4DCH_PWMPW8                2047
#define PWM4DC8                       2048
#define PWM4DCH_DC8                   2049
#define PWM4DCH_PWMPW9                2050
#define PWM4DC9                       2051
#define PWM4DCH_DC9                   2052
#define PWM4CON                       2053
#define PWM4POL                       2054
#define PWM4CON_POL                   2055
#define PWM4CON_OUT                   2056
#define PWM4OUT                       2057
#define PWM4EN                        2058
#define PWM4CON_EN                    2059
#define PWM3DCL                       2060
#define PWM3DC0                       2061
#define PWM3DCL_PWMPW0                2062
#define PWM3DCL_DC0                   2063
#define PWM3DCL_DC                    2064
#define PWM3DC1                       2065
#define PWM3DCL_PWMPW1                2066
#define PWM3DCL_DC1                   2067
#define PWM3DCH                       2068
#define PWM3DC2                       2069
#define PWM3DCH_DC2                   2070
#define PWM3DCH_DC                    2071
#define PWM3DCH_PWMPW2                2072
#define PWM3DC3                       2073
#define PWM3DCH_DC3                   2074
#define PWM3DCH_PWMPW3                2075
#define PWM3DC4                       2076
#define PWM3DCH_DC4                   2077
#define PWM3DCH_PWMPW4                2078
#define PWM3DC5                       2079
#define PWM3DCH_DC5                   2080
#define PWM3DCH_PWMPW5                2081
#define PWM3DC6                       2082
#define PWM3DCH_DC6                   2083
#define PWM3DCH_PWMPW6                2084
#define PWM3DC7                       2085
#define PWM3DCH_DC7                   2086
#define PWM3DCH_PWMPW7                2087
#define PWM3DC8                       2088
#define PWM3DCH_DC8                   2089
#define PWM3DCH_PWMPW8                2090
#define PWM3DC9                       2091
#define PWM3DCH_DC9                   2092
#define PWM3DCH_PWMPW9                2093
#define PWM3CON                       2094
#define PWM3CON_POL                   2095
#define PWM3POL                       2096
#define PWM3CON_OUT                   2097
#define PWM3OUT                       2098
#define PWM3EN                        2099
#define PWM3CON_EN                    2100
#define CCPR2L                        2101
#define CCPR2L_RL                     2102
#define CCPR2H                        2103
#define CCPR2H_RH                     2104
#define CCP2CON                       2105
#define CCP2MODE                      2106
#define CCP2MODE0                     2107
#define CCP2CON_MODE0                 2108
#define CCP2CON_MODE                  2109
#define CCP2MODE1                     2110
#define CCP2CON_MODE1                 2111
#define CCP2MODE2                     2112
#define CCP2CON_MODE2                 2113
#define CCP2MODE3                     2114
#define CCP2CON_MODE3                 2115
#define CCP2FMT                       2116
#define CCP2CON_FMT                   2117
#define CCP2OUT                       2118
#define CCP2CON_OUT                   2119
#define CCP2EN                        2120
#define CCP2CON_EN                    2121
#define CCP2CAP                       2122
#define CCP2CAP_CTS                   2123
#define CCP2CAP_CTS0                  2124
#define CCP2CTS                       2125
#define CCP2CTS0                      2126
#define CCP2CAP_CTS1                  2127
#define CCP2CTS1                      2128
#define CCPR1L                        2129
#define CCPR1L_RL                     2130
#define CCPR1H                        2131
#define CCPR1H_RH                     2132
#define CCP1CON                       2133
#define CCP1MODE0                     2134
#define CCP1CON_MODE0                 2135
#define CCP1CON_MODE                  2136
#define CCP1MODE                      2137
#define CCP1MODE1                     2138
#define CCP1CON_MODE1                 2139
#define CCP1MODE2                     2140
#define CCP1CON_MODE2                 2141
#define CCP1MODE3                     2142
#define CCP1CON_MODE3                 2143
#define CCP1FMT                       2144
#define CCP1CON_FMT                   2145
#define CCP1CON_OUT                   2146
#define CCP1OUT                       2147
#define CCP1EN                        2148
#define CCP1CON_EN                    2149
#define P1M1                          2150
#define CCP1CAP                       2151
#define CCP1CTS0                      2152
#define CCP1CAP_CTS                   2153
#define CCP1CAP_CTS0                  2154
#define CCP1CTS                       2155
#define CCP1CTS1                      2156
#define CCP1CAP_CTS1                  2157
#define CCPTMRS                       2158
#define C1TSEL0                       2159
#define C1TSEL                        2160
#define C1TSEL1                       2161
#define C2TSEL0                       2162
#define C2TSEL                        2163
#define C2TSEL1                       2164
#define P3TSEL                        2165
#define P3TSEL0                       2166
#define P3TSEL1                       2167
#define P4TSEL0                       2168
#define P4TSEL                        2169
#define P4TSEL1                       2170
#define T6TMR                         2171
#define TMR6                          2172
#define T6PR                          2173
#define PR6                           2174
#define T6CON                         2175
#define T6CON_OUTPS0                  2176
#define T6OUTPS                       2177
#define T6CON_OUTPS                   2178
#define T6OUTPS0                      2179
#define T6CON_OUTPS1                  2180
#define T6OUTPS1                      2181
#define T6CON_OUTPS2                  2182
#define T6OUTPS2                      2183
#define T6CON_OUTPS3                  2184
#define T6OUTPS3                      2185
#define T6CON_CKPS0                   2186
#define T6CKPS                        2187
#define T6CKPS0                       2188
#define T6CON_CKPS                    2189
#define T6CON_CKPS1                   2190
#define T6CKPS1                       2191
#define T6CON_CKPS2                   2192
#define T6CKPS2                       2193
#define TMR6ON                        2194
#define T6ON                          2195
#define T6CON_ON                      2196
#define T6HLT                         2197
#define T6HLT_MODE0                   2198
#define T6HLT_MODE                    2199
#define T6MODE0                       2200
#define T6MODE                        2201
#define T6HLT_MODE1                   2202
#define T6MODE1                       2203
#define T6MODE2                       2204
#define T6HLT_MODE2                   2205
#define T6HLT_MODE3                   2206
