tiborsimon/embedded-tdd-headers/pic/8bit/pic18f24k40_tdd.h
#define T6MODE3                       2207
#define T6MODE4                       2208
#define T6HLT_MODE4                   2209
#define T6CKSYNC                      2210
#define T6HLT_CKSYNC                  2211
#define T6CKPOL                       2212
#define T6HLT_CKPOL                   2213
#define T6PSYNC                       2214
#define T6HLT_PSYNC                   2215
#define T6CLKCON                      2216
#define T6CS                          2217
#define T6CS0                         2218
#define T6CS1                         2219
#define T6CS2                         2220
#define T6CS3                         2221
#define T6RST                         2222
#define T6RST_RSEL                    2223
#define T6RST_RSEL0                   2224
#define T6RSEL                        2225
#define T6RSEL0                       2226
#define T6RST_RSEL1                   2227
#define T6RSEL1                       2228
#define T6RSEL2                       2229
#define T6RST_RSEL2                   2230
#define T6RST_RSEL3                   2231
#define T6RSEL3                       2232
#define T4TMR                         2233
#define TMR4                          2234
#define T4PR                          2235
#define PR4                           2236
#define T4CON                         2237
#define T4OUTPS0                      2238
#define T4CON_OUTPS                   2239
#define T4OUTPS                       2240
#define T4CON_OUTPS0                  2241
#define T4OUTPS1                      2242
#define T4CON_OUTPS1                  2243
#define T4CON_OUTPS2                  2244
#define T4OUTPS2                      2245
#define T4OUTPS3                      2246
#define T4CON_OUTPS3                  2247
#define T4CON_CKPS0                   2248
#define T4CKPS0                       2249
#define T4CON_CKPS                    2250
#define T4CKPS                        2251
#define T4CKPS1                       2252
#define T4CON_CKPS1                   2253
#define T4CKPS2                       2254
#define T4CON_CKPS2                   2255
#define T4ON                          2256
#define T4CON_ON                      2257
#define TMR4ON                        2258
#define T4HLT                         2259
#define T4MODE                        2260
#define T4HLT_MODE                    2261
#define T4HLT_MODE0                   2262
#define T4MODE0                       2263
#define T4HLT_MODE1                   2264
#define T4MODE1                       2265
#define T4HLT_MODE2                   2266
#define T4MODE2                       2267
#define T4HLT_MODE3                   2268
#define T4MODE3                       2269
#define T4HLT_MODE4                   2270
#define T4MODE4                       2271
#define T4HLT_CKSYNC                  2272
#define T4CKSYNC                      2273
#define T4HLT_CKPOL                   2274
#define T4CKPOL                       2275
#define T4PSYNC                       2276
#define T4HLT_PSYNC                   2277
#define T4CLKCON                      2278
#define T4CS0                         2279
#define T4CS                          2280
#define T4CS1                         2281
#define T4CS2                         2282
#define T4CS3                         2283
#define T4RST                         2284
#define T4RSEL0                       2285
#define T4RSEL                        2286
#define T4RST_RSEL                    2287
#define T4RST_RSEL0                   2288
#define T4RSEL1                       2289
#define T4RST_RSEL1                   2290
#define T4RSEL2                       2291
#define T4RST_RSEL2                   2292
#define T4RSEL3                       2293
#define T4RST_RSEL3                   2294
#define T2TMR                         2295
#define TMR2                          2296
#define T2PR                          2297
#define PR2                           2298
#define T2CON                         2299
#define T2OUTPS0                      2300
#define T2CON_OUTPS0                  2301
#define T2OUTPS                       2302
#define T2CON_OUTPS                   2303
#define T2OUTPS1                      2304
#define T2CON_OUTPS1                  2305
#define T2OUTPS2                      2306
#define T2CON_OUTPS2                  2307
#define T2OUTPS3                      2308
#define T2CON_OUTPS3                  2309
#define T2CKPS0                       2310
#define T2CON_CKPS                    2311
#define T2CKPS                        2312
#define T2CON_CKPS0                   2313
#define T2CKPS1                       2314
#define T2CON_CKPS1                   2315
#define T2CKPS2                       2316
#define T2CON_CKPS2                   2317
#define T2CON_ON                      2318
#define TMR2ON                        2319
#define T2ON                          2320
#define T2HLT                         2321
#define T2HLT_MODE                    2322
#define T2MODE                        2323
#define T2MODE0                       2324
#define T2HLT_MODE0                   2325
#define T2MODE1                       2326
#define T2HLT_MODE1                   2327
#define T2MODE2                       2328
#define T2HLT_MODE2                   2329
#define T2MODE3                       2330
#define T2HLT_MODE3                   2331
#define T2MODE4                       2332
#define T2HLT_MODE4                   2333
#define T2HLT_CKSYNC                  2334
#define T2CKSYNC                      2335
#define T2HLT_CKPOL                   2336
#define T2CKPOL                       2337
#define T2PSYNC                       2338
#define T2HLT_PSYNC                   2339
#define T2CLKCON                      2340
#define T2CS                          2341
#define T2CS0                         2342
#define T2CS1                         2343
#define T2CS2                         2344
#define T2CS3                         2345
#define T2RST                         2346
#define T2RSEL0                       2347
#define T2RST_RSEL                    2348
#define T2RSEL                        2349
#define T2RST_RSEL0                   2350
#define T2RSEL1                       2351
#define T2RST_RSEL1                   2352
#define T2RST_RSEL2                   2353
#define T2RSEL2                       2354
#define T2RSEL3                       2355
#define T2RST_RSEL3                   2356
#define TMR5L                         2357
#define TMR5L0                        2358
#define TMR5L1                        2359
#define TMR5L2                        2360
#define TMR5L3                        2361
#define TMR5L4                        2362
#define TMR5L5                        2363
#define TMR5L6                        2364
#define TMR5L7                        2365
#define TMR5H0                        2366
#define TMR5H                         2367
#define TMR5H1                        2368
#define TMR5H2                        2369
#define TMR5H3                        2370
#define TMR5H4                        2371
#define TMR5H5                        2372
#define TMR5H6                        2373
#define TMR5H7                        2374
#define T5CON                         2375
#define T5CON_ON                      2376
#define TMR5ON                        2377
#define T5CON_RD16                    2378
#define T5RD16                        2379
#define RD165                         2380
#define nT5SYNC                       2381
#define T5CON_nSYNC                   2382
#define T5CON_NOT_SYNC                2383
#define NOT_T5SYNC                    2384
#define T5CON_CKPS0                   2385
#define T5CON_CKPS                    2386
#define T5CKPS0                       2387
#define T5CON_CKPS1                   2388
#define T5CKPS1                       2389
#define T5GCON                        2390
#define T5GCON_GVAL                   2391
#define T5GVAL                        2392
#define T5GGO_nDONE                   2393
#define T5GCON_GGO_NOT_DONE           2394
#define T5GCON_GGO_nDONE              2395
#define T5GGO_NOT_DONE                2396
#define T5GGO                         2397
#define T5GCON_GSPM                   2398
#define T5GSPM                        2399
#define T5GTM                         2400
#define T5GCON_GTM                    2401
#define T5GPOL                        2402
#define T5GCON_GPOL                   2403
#define T5GCON_GE                     2404
#define T5GE                          2405
#define T5GATE                        2406
#define T5GATE_GSS0                   2407
#define T5GSS0                        2408
#define T5GATE_GSS                    2409
#define T5GATE_GSS1                   2410
#define T5GSS1                        2411
#define T5GATE_GSS2                   2412
#define T5GSS2                        2413
#define T5GATE_GSS3                   2414
#define T5GSS3                        2415
#define T5CLK                         2416
#define T5CS0                         2417
#define T5CLK_CS                      2418
#define T5CLK_CS0                     2419
#define T5CS1                         2420
#define T5CLK_CS1                     2421
#define T5CS2                         2422
#define T5CLK_CS2                     2423
#define T5CS3                         2424
#define T5CLK_CS3                     2425
#define TMR3L0                        2426
#define TMR3L                         2427
#define TMR3L1                        2428
#define TMR3L2                        2429
#define TMR3L3                        2430
#define TMR3L4                        2431
#define TMR3L5                        2432
#define TMR3L6                        2433
#define TMR3L7                        2434
#define TMR3H                         2435
#define TMR3H0                        2436
#define TMR3H1                        2437
#define TMR3H2                        2438
#define TMR3H3                        2439
#define TMR3H4                        2440
#define TMR3H5                        2441
#define TMR3H6                        2442
#define TMR3H7                        2443
#define T3CON                         2444
#define T3CON_ON                      2445
#define TMR3ON                        2446
#define T3CON_RD16                    2447
#define RD163                         2448
#define T3RD16                        2449
#define T3CON_NOT_SYNC                2450
#define T3CON_nSYNC                   2451
#define NOT_T3SYNC                    2452
#define nT3SYNC                       2453
#define T3CKPS0                       2454
#define T3CON_CKPS0                   2455
#define T3CON_CKPS                    2456
#define T3CKPS1                       2457
#define T3CON_CKPS1                   2458
#define T3GCON                        2459
#define T3GVAL                        2460
#define T3GCON_GVAL                   2461
#define T3GGO                         2462
#define T3GGO_NOT_DONE                2463
#define T3GCON_GGO_nDONE              2464
#define T3GGO_nDONE                   2465
#define T3GCON_GGO_NOT_DONE           2466
#define T3GCON_GSPM                   2467
#define T3GSPM                        2468
#define T3GCON_GTM                    2469
#define T3GTM                         2470
#define T3GCON_GPOL                   2471
#define T3GPOL                        2472
#define T3GCON_GE                     2473
#define T3GE                          2474
#define T3GATE                        2475
#define T3GSS0                        2476
#define T3GATE_GSS0                   2477
#define T3GATE_GSS                    2478
#define T3GSS1                        2479
#define T3GATE_GSS1                   2480
#define T3GSS2                        2481
#define T3GATE_GSS2                   2482
#define T3GSS3                        2483
#define T3GATE_GSS3                   2484
#define T3CLK                         2485
#define T3CLK_CS                      2486
#define T3CLK_CS0                     2487
#define T3CS0                         2488
#define T3CLK_CS1                     2489
#define T3CS1                         2490
#define T3CLK_CS2                     2491
#define T3CS2                         2492
#define T3CS3                         2493
#define T3CLK_CS3                     2494
#define TMR1L                         2495
#define TMR1L0                        2496
#define TMR1L1                        2497
#define TMR1L2                        2498
#define TMR1L3                        2499
#define TMR1L4                        2500
#define TMR1L5                        2501
#define TMR1L6                        2502
#define TMR1L7                        2503
#define TMR1H0                        2504
#define TMR1H                         2505
#define TMR1H1                        2506
#define TMR1H2                        2507
#define TMR1H3                        2508
#define TMR1H4                        2509
#define TMR1H5                        2510
#define TMR1H6                        2511
#define TMR1H7                        2512
#define T1CON                         2513
#define TMR1ON                        2514
#define T1CON_ON                      2515
#define T1CON_RD16                    2516
#define T1RD16                        2517
#define NOT_T1SYNC                    2518
#define T1CON_nSYNC                   2519
#define nT1SYNC                       2520
#define T1CON_NOT_SYNC                2521
#define T1CON_CKPS0                   2522
#define T1CKPS0                       2523
#define T1CON_CKPS                    2524
#define T1CKPS1                       2525
#define T1CON_CKPS1                   2526
#define T1GCON                        2527
#define T1GCON_GVAL                   2528
#define T1GVAL                        2529
#define T1GGO_NOT_DONE                2530
#define T1GGO_nDONE                   2531
#define T1GCON_GGO_nDONE              2532
#define T1GCON_GGO_NOT_DONE           2533
#define T1GGO                         2534
#define T1GCON_GSPM                   2535
#define T1GSPM                        2536
#define T1GTM                         2537
#define T1GCON_GTM                    2538
#define T1GPOL                        2539
#define T1GCON_GPOL                   2540
#define T1GCON_GE                     2541
#define T1GE                          2542
#define T1GATE                        2543
#define T1GATE_GSS0                   2544
#define T1GSS0                        2545
#define T1GATE_GSS                    2546
#define T1GATE_GSS1                   2547
#define T1GSS1                        2548
#define T1GSS2                        2549
#define T1GATE_GSS2                   2550
#define T1GSS3                        2551
#define T1GATE_GSS3                   2552
#define T1CLK                         2553
#define T1CS0                         2554
#define T1CLK_CS                      2555
#define T1CLK_CS0                     2556
#define T1CLK_CS1                     2557
#define T1CS1                         2558
#define T1CS2                         2559
#define T1CLK_CS2                     2560
#define T1CS3                         2561
#define T1CLK_CS3                     2562
#define TMR0L0                        2563
#define TMR0L                         2564
#define TMR0L1                        2565
#define TMR0L2                        2566
#define TMR0L3                        2567
#define TMR0L4                        2568
#define TMR0L5                        2569
#define TMR0L6                        2570
#define TMR0L7                        2571
#define TMR0H0                        2572
#define T0PR                          2573
#define TMR0H                         2574
#define T0PR0                         2575
#define TMR0H1                        2576
#define T0PR1                         2577
#define TMR0H2                        2578
#define T0PR2                         2579
#define TMR0H3                        2580
#define T0PR3                         2581
#define TMR0H4                        2582
#define T0PR4                         2583
#define TMR0H5                        2584
#define T0PR5                         2585
#define TMR0H6                        2586
#define T0PR6                         2587
#define TMR0H7                        2588
#define T0PR7                         2589
#define T0CON0                        2590
#define T0OUTPS                       2591
#define T0OUTPS0                      2592
#define T0OUTPS1                      2593
#define T0OUTPS2                      2594
#define T0OUTPS3                      2595
#define T016BIT                       2596
#define T0OUT                         2597
#define T0EN                          2598
#define T0CON1                        2599
#define T0PS                          2600
#define T0CKPS                        2601
#define T0CKPS0                       2602
#define T0PS0                         2603
#define T0CKPS1                       2604
#define T0PS1                         2605
#define T0CKPS2                       2606
#define T0PS2                         2607
#define T0CKPS3                       2608
#define T0PS3                         2609
#define T0ASYNC                       2610
#define T0CS                          2611
#define T0CS0                         2612
#define T0CS1                         2613
#define T0CS2                         2614
#define PCON0                         2615
#define BOR                           2616
#define NOT_BOR                       2617
#define nBOR                          2618
#define POR                           2619
#define nPOR                          2620
#define NOT_POR                       2621
#define nRI                           2622
#define NOT_RI                        2623
#define RI                            2624
#define NOT_RMCLR                     2625
#define nRMCLR                        2626
#define RMCLR                         2627
#define NOT_RWDT                      2628
#define nRWDT                         2629
#define RWDT                          2630
#define nWDTWV                        2631
#define WDTWV                         2632
#define NOT_WDTWV                     2633
#define STKUNF                        2634
#define STKOVF                        2635
#define STATUS                        2636
#define C                             2637
#define CARRY                         2638
#define STATUS_DC                     2639
#define ZERO                          2640
#define Z                             2641
#define OV                            2642
#define OVERFLOW                      2643
#define N                             2644
#define NEGATIVE                      2645
#define PD                            2646
#define nPD                           2647
#define NOT_PD                        2648
#define TO                            2649
#define NOT_TO                        2650
#define nTO                           2651
#define FSR2L                         2652
#define PLUSW2                        2653
#define PREINC2                       2654
#define POSTDEC2                      2655
#define POSTINC2                      2656
#define INDF2                         2657
#define FSR1L                         2658
#define PLUSW1                        2659
#define PREINC1                       2660
#define POSTDEC1                      2661
#define POSTINC1                      2662
#define INDF1                         2663
#define WREG                          2664
#define FSR0L                         2665
#define PLUSW0                        2666
#define PREINC0                       2667
#define POSTDEC0                      2668
#define POSTINC0                      2669
#define INDF0                         2670
#define INTCON                        2671
#define INT0EDG                       2672
#define INT1EDG                       2673
#define INT2EDG                       2674
#define IPEN                          2675
#define PEIE                          2676
#define PEIE_GIEL                     2677
#define GIEL                          2678
#define GIE                           2679
#define GIE_GIEH                      2680
#define GIEH                          2681
#define PRODL                         2682
#define PRODH                         2683
#define TABLAT                        2684
#define TBLPTRL                       2685
#define TBLPTRH                       2686
#define TBLPTRU                       2687
#define ACSS                          2688
#define PCL                           2689
#define PCLATH                        2690
#define PCLATH_PCH                    2691
#define PCLATU                        2692
#define PCU                           2693
#define STKPTR0                       2694
#define STKPTR                        2695
#define SP0                           2696
#define STKPTR1                       2697
#define SP1                           2698
#define STKPTR2                       2699
#define SP2                           2700
#define SP3                           2701
#define STKPTR3                       2702
#define STKPTR4                       2703
#define SP4                           2704
#define STKPTR5                       2705
#define SP5                           2706
#define TOSL                          2707
#define TOSH                          2708

#endif // _PIC18F24K40_H_
